quantummongolia/industrial-iot/esp32_firmware/teerem/src/main.cpp
/*
 * ============================================================
 *  ESP32-S3-Zero Тээрэм + Цахилгаан тоолуурууд → Firebase RTDB
 * ============================================================
 *
 *  Нэг RS485 шугам дээр Modbus RTU @ 19200bps :
 *    Slave 1 : Тээрмийн тэжээлийн жин (flow t/h + cumulative t)
 *    Slave 2 : SPM33 — Боловсруулах үйлдвэр ХС     (P, E)
 *    Slave 3 : SPM33 — Нунтаглах хэсэг ХС          (P, E)
 *    Slave 4 : SPM33 — Бөмбөлөгт тээрэм 1          (P, E, Ia/Ib/Ic)
 *    Slave 5 : SPM33 — Бөмбөлөгт тээрэм 2          (P, E, Ia/Ib/Ic)
 *    Slave 6 : Тээрмийн тэжээлийн ус (flowmeter)   (flow rate + totalizer)
 *
 *  Firebase RTDB:
 *    /teerem/weight_rate, /teerem/cumulative_kg, /teerem/last_updated
 *    /teerem/feed_water/{flow_rate,totalizer}
 *    /energy_meters/em01/{power_kw,total_energy_kwh}
 *    /energy_meters/em02/{power_kw,total_energy_kwh}
 *    /energy_meters/em04/{power_kw,total_energy_kwh,current_a,current_b,current_c}
 *    /energy_meters/em05/{power_kw,total_energy_kwh,current_a,current_b,current_c}
 *
 *  Pinout (S3-Zero):
 *    GPIO 4 — MAX485 RO  (RX)
 *    GPIO 5 — MAX485 DI  (TX)
 *    GPIO 6 — MAX485 DE+RE
 */

#include "secrets.h"

// Нөөц WiFi (Photon). Тодорхойлоогүй хуучин secrets.h-тэй ажиллах — хоосон = нөөцгүй.
#ifndef WIFI_SSID2
#define WIFI_SSID2 ""
#define WIFI_PASSWORD2 ""
#endif
#include "ota.h"
#include <Arduino.h>
#include <Firebase_ESP_Client.h>
#include <WiFi.h>
#include <addons/RTDBHelper.h>
#include <addons/TokenHelper.h>
#include <esp_task_wdt.h>

// ── Modbus тохиргоо ────────────────────────────────────────────────────
namespace cfg {
constexpr uint8_t RX_PIN = 4;
constexpr uint8_t TX_PIN = 5;
constexpr uint8_t DE_RE = 6;
constexpr uint32_t BAUD = 9600;

// Slave IDs
constexpr uint8_t SCALE_SLAVE = 1; // Тээрмийн жин
constexpr uint8_t EM01_SLAVE = 2;  // Боловсруулах үйлдвэр ХС
constexpr uint8_t EM02_SLAVE = 3;  // Нунтаглах хэсэг ХС
constexpr uint8_t EM04_SLAVE = 4;  // Бөмбөлөгт тээрэм 1
constexpr uint8_t EM05_SLAVE = 5;  // Бөмбөлөгт тээрэм 2
constexpr uint8_t FLOW_SLAVE = 6;  // Тээрмийн тэжээлийн ус (flowmeter)
constexpr uint8_t ULS_SLAVE = 7;   // Supmea ultrasonic — Эргэлтийн усан сан

// Тэжээлийн жин (одоо байгаа сенсор)
constexpr uint16_t REG_FLOW = 0;     // 40001: Flow Rate (Float, t/h)
constexpr uint16_t REG_WEIGHT_T = 6; // 40007: Cumulative weight (Double, t)

// Тээрмийн тэжээлийн ус (flowmeter project-той ижил registers)
constexpr uint16_t FLOW_REG_RATE = 0x0000;  // [0..1] Flow rate float BE
constexpr uint16_t FLOW_REG_TOTAL = 0x0003; // [3..6] uint32 int + float frac

// Ultrasonic level transmitter — Level instantaneous (uint16, raw/1000 = m)
constexpr uint16_t REG_ULS_LEVEL = 0x2002;
constexpr uint16_t REG_ULS_MOUNT = 0x2009; // Mount Height — суурилуулалтын нийт өндөр (raw/1000 = m, W/R)

// SPM33 register addresses (4xxxx - 40001 = Modbus address)
constexpr uint16_t SPM33_REG_IA = 6;     // 40007: Phase A current (UINT16, ×0.001 A)
constexpr uint16_t SPM33_REG_POWER = 10; // 40011: Total active power LINT32, ×0.1 W
constexpr uint16_t SPM33_REG_ENERGY = 25; // 40026: Total active energy LUINT32, ×0.1 kWh
constexpr uint16_t SPM33_REG_CT_PRI = 201; // 40202: CT primary side value (1..50000)
constexpr uint8_t SPM33_CT_SEC = 5;        // SPM33 CT secondary side (5A typical)

constexpr uint32_t POLL_MS = 3000;                // Flow cycle interval (tick rate)
constexpr uint32_t TOTALIZER_INTERVAL_MS = 60000; // Totalizer cycle — 1 минут тутамд
constexpr uint32_t RX_TMO = 200;
constexpr uint32_t FRAME_GAP_MS = 10;

constexpr uint32_t WDT_TIMEOUT_S = 30;
constexpr uint32_t WIFI_RETRY_MS = 10000;
constexpr uint8_t  FB_FAILOVER_STREAK = 5;               // Mandal дээр Firebase энэ удаа дараалан алдвал нөөц рүү
constexpr uint32_t BACKUP_HOLD_MS = 2UL * 60UL * 1000UL; // Photon дээр энэ хугацаанд барина; дараа нь Mandal-ыг дахин үзнэ
constexpr uint8_t MODBUS_RETRY = 2;
constexpr uint8_t MAX_CONSECUTIVE_FAILS = 10;
constexpr uint8_t MAX_RECOVERY_ATTEMPTS = 20;

// Long-running stability — flowmeter firmware-тэй ижил pattern
constexpr uint32_t MIN_FREE_HEAP_BYTES = 20480;                  // 20KB threshold
constexpr uint32_t MAX_UPTIME_MS = 24UL * 60UL * 60UL * 1000UL;  // 24 цаг
constexpr uint32_t HEAP_LOG_INTERVAL_MS = 5UL * 60UL * 1000UL;   // 5 минут тутам log
} // namespace cfg

// ── RGB STATUS LED (WS2812 GPIO 21 — Waveshare ESP32-S3-Zero onboard) ──
//   SLOW_RED — WiFi / Modbus / Firebase аль нэг нь алдсан үед удаан анивчина
//              (500ms on / 500ms off → 1 Hz).
//   pulse()  — Firebase-д амжилттай upload болгонд нэг богино ногоон импульс
//              (~120ms). Modbus poll-ийн 1 Hz ритмтэй синхрон.
namespace led {
constexpr uint8_t PIN = 21;
constexpr uint8_t BRIGHTNESS = 60;
constexpr uint16_t SLOW_ON_MS = 500;
constexpr uint16_t SLOW_OFF_MS = 500;
constexpr uint16_t PULSE_MS = 120;

inline void writeRGB(uint8_t r, uint8_t g, uint8_t b) {
  // Энэ board-ийн WS2812 чип нь R/G сувгуудыг солиод эмиттэр-лж байна
  // (rgbLedWrite-ийн GRB conversion нь зарим S3-Zero batch-д таарахгүй).
  // Тиймээс r ба g-г солиод дамжуулна — дуудлагын талд "red"/"green" хэвээр.
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  rgbLedWrite(PIN, g, r, b);
#else
  neopixelWrite(PIN, g, r, b);
#endif
}

inline uint8_t scale(uint8_t v) { return (uint16_t(v) * BRIGHTNESS) / 255; }

enum Mode { OFF, SLOW_RED };
// Boot үед өгөгдөл хараахан явуулаагүй учир улаан анивчиж эхэлнэ.
// Эхний амжилттай upload-аас хойш OFF болж ногоон pulse-ээр л асна.
Mode mode = SLOW_RED;
unsigned long nextToggle = 0;
unsigned long pulseOffAt = 0;
bool on = false;

void begin() { writeRGB(0, 0, 0); }

void setMode(Mode m) {
  if (m == mode)
    return;
  mode = m;
  on = false;
  nextToggle = millis();
  if (m == OFF)
    writeRGB(0, 0, 0);
}

// One-shot green pulse — амжилттай upload болгонд дуудагдана.
void pulse() {
  pulseOffAt = millis() + PULSE_MS;
  writeRGB(0, scale(255), 0);
}

void update() {
  unsigned long now = millis();

