quantummongolia/industrial-iot/esp32_firmware/teerem/src/main.cpp
// Modbus retry helper
template <typename F>
static bool withRetry(F &&fn) {
  for (uint8_t i = 0; i < cfg::MODBUS_RETRY; i++) {
    if (fn())
      return true;
    if (i + 1 < cfg::MODBUS_RETRY)
      delay(cfg::FRAME_GAP_MS);
  }
  return false;
}

// CT primary бол метр дээр гараар тохируулдаг тогтмол тоо (рег. 40202).
// Boot үед уншиж кэшилнэ. Бүтэлгүй бол loop() cycle бүрт амжилттай болтол дахин
// оролдоно. Метр дээр CT-г өөрчилсөн бол ESP32-г restart хийхэд шинэ утга авна.
static uint16_t ctPrimary[6] = {1, 1, 1, 1, 1, 1};
static bool ctPrimaryKnown[6] = {false, false, false, false, false, false};

bool Spm33_readCtPrimary(Modbus &mb, uint8_t slave) {
  uint16_t v = 0;
  bool ok = withRetry([&] { return mb.readU16(slave, cfg::SPM33_REG_CT_PRI, v); });
  if (ok && v > 0) {
    ctPrimary[slave] = v;
    ctPrimaryKnown[slave] = true;
    Serial.printf("[SPM33 #%u] CT primary = %u A\n", slave, v);
    return true;
  }
  return false;
}

// Flow cycle (2с тутам) — зөвхөн power + сонгож гүйдэл уншина. Energy уншихгүй.
Spm33Reading Spm33_readPower(Modbus &mb, uint8_t slave, bool withCurrents) {
  Spm33Reading r;

  int32_t powerRaw = 0;
  r.powerOk = withRetry(
      [&] { return mb.readI32LowFirst(slave, cfg::SPM33_REG_POWER, powerRaw); });
  if (r.powerOk) {
    // Secondary side W (×0.1). To primary side: × (CT_pri / CT_sec).
    float secW = powerRaw * 0.1f;
    float priW = secW * (float)ctPrimary[slave] / (float)cfg::SPM33_CT_SEC;
    r.powerKW = priW / 1000.0f;
  }

  if (withCurrents) {
    delay(cfg::FRAME_GAP_MS);
    uint16_t ix[3] = {0, 0, 0};
    r.currentsOk = withRetry([&] {
      return mb.readU16x3(slave, cfg::SPM33_REG_IA, ix);
    });
    if (r.currentsOk) {
      const float k = 0.001f * (float)ctPrimary[slave] / (float)cfg::SPM33_CT_SEC;
      r.currentA = ix[0] * k;
      r.currentB = ix[1] * k;
      r.currentC = ix[2] * k;
    }
  }

  return r;
}

// Totalizer cycle (60с тутам) — зөвхөн нийт идэвхтэй энерги уншина.
Spm33Reading Spm33_readEnergy(Modbus &mb, uint8_t slave) {
  Spm33Reading r;

  uint32_t energyRaw = 0;
  r.energyOk = withRetry(
      [&] { return mb.readU32LowFirst(slave, cfg::SPM33_REG_ENERGY, energyRaw); });
  if (r.energyOk) {
    // 40026 нь primary side kWh-ийг ×0.1-ээр өгдөг (5.1 хүснэгт)
    r.energyKWh = energyRaw * 0.1f;
  }

  return r;
}

// ── Глобал ─────────────────────────────────────────────────────────────
Modbus modbus;
FirebaseData fbData;
FirebaseAuth fbAuth;
FirebaseConfig fbConfig;

bool firebaseReady = false;
unsigned long lastWifiCheck = 0;
unsigned long lastTotalizerReadTime = 0; // Сүүлд totalizer уншсан агшин (ms)
unsigned long lastHeapLogTime = 0;       // Сүүлд heap-н хэмжээг log хийсэн агшин

unsigned int consecutiveReadFails = 0;
unsigned int totalRecoveryAttempts = 0;

unsigned long fbNextAllowedAt = 0;
unsigned int fbFailStreak = 0;
bool wifiOnBackup = false;            // одоо нөөц сүлжээ (Photon) дээр байна уу
unsigned long primaryRetryAt = 0;     // нөөц дээр байх үед энэ хугацаанд Mandal-ыг дахин шалгана

// Totalizer утга 1 минутад нэг л шинэчлэгдэх тул хооронд нь cache-д хадгална.
// Анхны boot-д valid biш — эхний амжилттай уншилт хүртэл Firebase-руу бичигдэхгүй.
double cachedWeightT = 0.0;        bool cachedWeightTValid = false;
float  cachedEm01EnergyKWh = 0.0f; bool cachedEm01EnergyValid = false;
float  cachedEm02EnergyKWh = 0.0f; bool cachedEm02EnergyValid = false;
float  cachedEm04EnergyKWh = 0.0f; bool cachedEm04EnergyValid = false;
float  cachedEm05EnergyKWh = 0.0f; bool cachedEm05EnergyValid = false;
float  cachedFeedTotal = 0.0f;     bool cachedFeedTotalValid = false;

// Ultrasonic mount height (рег. 0x2009) — boot дээр нэг удаа уншиж Firebase-д
// нэг удаа нийтэлнэ. Дашбоард савны дээд хязгаарт (data-max) ашиглана.
float ulsMountM = 0.0f; bool ulsMountKnown = false; bool ulsMountSent = false;

void fbOnFailure() {
  fbFailStreak++;
  unsigned long backoff =
      2000UL * (1UL << min((unsigned int)8, fbFailStreak));
  if (backoff > 300000UL)
    backoff = 300000UL;
  fbNextAllowedAt = millis() + backoff;
  Serial.printf("[Firebase] Backoff %lus (fail streak %u)\n", backoff / 1000,
                fbFailStreak);
}

void fbOnSuccess() {
  if (fbFailStreak > 0)
    Serial.println("[Firebase] Recovered");
  fbFailStreak = 0;
  fbNextAllowedAt = 0;
}

bool fbCanUpload() { return (long)(millis() - fbNextAllowedAt) >= 0; }

void recoverModbusBus() {
  totalRecoveryAttempts++;
  Serial.printf("[Recovery] Attempt #%u after %u failed cycles\n",
                totalRecoveryAttempts, consecutiveReadFails);
  if (totalRecoveryAttempts >= cfg::MAX_RECOVERY_ATTEMPTS) {
    Serial.println("[Recovery] Max attempts — forcing reboot via WDT");
    delay(100);
    while (true) {
    }
  }
  modbus.recover();
  consecutiveReadFails = 0;
  Serial.println("[Recovery] RS485 bus re-initialized");
}

void onWifiEvent(WiFiEvent_t event) {
  switch (event) {
  case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    Serial.println("[WiFi] Disconnected — attempting auto-reconnect");
    WiFi.reconnect();
    break;
  case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    Serial.printf("[WiFi] Reconnected — IP: %s\n",
                  WiFi.localIP().toString().c_str());
    break;
  default:
    break;
  }
}

// Нөөц сүлжээ (Photon) тохируулсан эсэх.
static bool wifiHasBackup() { return WIFI_SSID2[0] != '\0'; }

// Нэг сүлжээнд блоклон холбогдохыг оролдоно. Амжилттай бол true.
static bool wifiTry(const char *ssid, const char *pass, uint32_t timeoutMs) {
  Serial.printf("[WiFi] Connecting to network: %s", ssid);
  WiFi.begin(ssid, pass);
  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < timeoutMs) {
    delay(500);
    Serial.print(".");
  }
  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\n[WiFi] Connected to %s — IP: %s\n", ssid,
                  WiFi.localIP().toString().c_str());
    return true;
  }
  Serial.printf("\n[WiFi] %s failed\n", ssid);
  return false;
}

// Strict-priority холболт: ҮРГЭЛЖ эхэлж үндсэн (Mandal) сүлжээнд оролдоно, зөвхөн
// бүтэхгүй үед нөөц (Photon) рүү шилжинэ. Дохионы хүчээр (RSSI) сонгохгүй.
void wifiConnect() {
  if (WiFi.status() == WL_CONNECTED)
    return;

  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.persistent(true);

  if (wifiTry(WIFI_SSID, WIFI_PASSWORD, 10000)) {
    wifiOnBackup = false;
    return;
  }
  if (wifiHasBackup() && wifiTry(WIFI_SSID2, WIFI_PASSWORD2, 10000)) {
    wifiOnBackup = true;
    primaryRetryAt = millis() + cfg::BACKUP_HOLD_MS;
    return;
  }
  Serial.println("[WiFi] All networks failed — will retry later");
}

