quantummongolia/industrial-iot/esp32_firmware/teerem/src/main.cpp
// Холбоотой үед ажиллах failover шийдвэр:
//  • Mandal дээр байгаа ч Firebase рүү өгөгдөл явахгүй (fail streak) бол → Photon руу.
//  • Photon дээр байгаа бол BACKUP_HOLD_MS тутамд Mandal сэргэсэн эсэхийг шалгана.
void wifiFailover(unsigned long now) {
  if (WiFi.status() != WL_CONNECTED || !wifiHasBackup())
    return;

  if (!wifiOnBackup) {
    // Үндсэн (Mandal) дээр. Firebase тогтмол алдаж, throttle гарсан бол нөөц рүү.
    if (fbFailStreak >= cfg::FB_FAILOVER_STREAK && now >= primaryRetryAt) {
      Serial.printf("[WiFi] Primary up but Firebase failing (streak %u) — trying backup\n",
                    fbFailStreak);
      primaryRetryAt = now + cfg::BACKUP_HOLD_MS;
      if (wifiTry(WIFI_SSID2, WIFI_PASSWORD2, 10000)) {
        wifiOnBackup = true;
      } else {
        Serial.println("[WiFi] Backup unavailable — staying on primary");
        wifiTry(WIFI_SSID, WIFI_PASSWORD, 10000);
      }
      fbFailStreak = 0;
      fbNextAllowedAt = 0;
    }
    return;
  }

  // Нөөц (Photon) дээр. Хааяа Mandal сэргэсэн эсэхийг шалгаж, сэргсэн бол буцна.
  if (now >= primaryRetryAt) {
    primaryRetryAt = now + cfg::BACKUP_HOLD_MS;
    Serial.println("[WiFi] Re-checking primary (Mandal)...");
    if (wifiTry(WIFI_SSID, WIFI_PASSWORD, 8000)) {
      wifiOnBackup = false;
      Serial.println("[WiFi] Back on primary (Mandal)");
    } else {
      wifiTry(WIFI_SSID2, WIFI_PASSWORD2, 10000);
    }
    fbFailStreak = 0;
    fbNextAllowedAt = 0;
  }
}

void firebaseInit() {
  fbConfig.api_key = FIREBASE_API_KEY;
  fbConfig.database_url = FIREBASE_DB_URL;
  fbAuth.user.email = FIREBASE_USER_EMAIL;
  fbAuth.user.password = FIREBASE_USER_PASS;
  fbConfig.token_status_callback = tokenStatusCallback;
  fbData.setBSSLBufferSize(2048, 2048);
  Firebase.begin(&fbConfig, &fbAuth);
  Firebase.reconnectNetwork(true);
  Serial.println("[Firebase] init — authenticating");
}

void setup() {
  Serial.begin(115200);
  delay(300);
  Serial.println("\n========= Teerem IoT (S3-Zero) =========");

  led::begin();
  xTaskCreatePinnedToCore(ledTask, "ledTask", 2048, nullptr, 1, nullptr, 0);

  modbus.begin();

  // SPM33 CT primary утгыг боотлох үед бүх 4 slave-ээс уншиж кэшилнэ — P
  // (40011) болон гүйдлийг secondary→primary хөрвүүлэхэд хэрэглэнэ. Унших нь
  // алдвал loop() cycle бүрт амжилттай болтол дахин оролдоно.
  delay(100);
  const uint8_t spmSlaves[4] = {cfg::EM01_SLAVE, cfg::EM02_SLAVE,
                                cfg::EM04_SLAVE, cfg::EM05_SLAVE};
  for (uint8_t s : spmSlaves) {
    Spm33_readCtPrimary(modbus, s);
    delay(cfg::FRAME_GAP_MS);
  }

  WiFi.onEvent(onWifiEvent);
  wifiConnect();
  firebaseInit();

  esp_task_wdt_config_t wdtConfig = {.timeout_ms = cfg::WDT_TIMEOUT_S * 1000,
                                     .idle_core_mask = 0,
                                     .trigger_panic = true};
  esp_task_wdt_reconfigure(&wdtConfig);
  esp_task_wdt_add(NULL);
  Serial.printf("[WDT] Watchdog started — %lu second timeout\n",
                (unsigned long)cfg::WDT_TIMEOUT_S);
}

void loop() {
  esp_task_wdt_reset();
  unsigned long now = millis();

  // ── Long-running stability watchdog ────────────────────────────────
  // Heap fragmentation (Firebase TLS буфер г.м.) удаан ажиллах тусам
  // хуримтлагдаж тогтворгүй болгож болзошгүй. 5 минут тутамд heap-г log
  // хийнэ. Free heap босгоос (20KB) доош унавал эсвэл uptime 24 цаг хэтэрвэл
  // cleaн restart хийнэ.
  if (now - lastHeapLogTime >= cfg::HEAP_LOG_INTERVAL_MS) {
    lastHeapLogTime = now;
    Serial.printf("[Heap] Free: %u | Min ever: %u | Uptime: %lus\n",
                  ESP.getFreeHeap(), ESP.getMinFreeHeap(), now / 1000);
  }
  if (ESP.getFreeHeap() < cfg::MIN_FREE_HEAP_BYTES) {
    Serial.printf("[Stability] Free heap %u < %u — restarting\n",
                  ESP.getFreeHeap(), cfg::MIN_FREE_HEAP_BYTES);
    delay(200);
    ESP.restart();
  }
  if (now >= cfg::MAX_UPTIME_MS) {
    Serial.println("[Stability] Reached 24h uptime — scheduled restart");
    delay(200);
    ESP.restart();
  }

  if (WiFi.status() != WL_CONNECTED &&
      now - lastWifiCheck >= cfg::WIFI_RETRY_MS) {
    lastWifiCheck = now;
    Serial.println("[WiFi] retry — reconnect (primary first)");
    wifiConnect();
  }
  wifiFailover(now);

  static unsigned long lastPoll = 0;
  if (now - lastPoll < cfg::POLL_MS)
    return;
  lastPoll = now;

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[WiFi] not connected");
    led::setMode(led::SLOW_RED);
    return;
  }

  // Boot үед уншиж чадаагүй CT primary-уудыг дахин оролдох — нэг slave/cycle
  // (RS485 bus-ыг сенсорын уншилттай зэрэгцэхгүй).
  {
    static const uint8_t spmSlaves[4] = {cfg::EM01_SLAVE, cfg::EM02_SLAVE,
                                         cfg::EM04_SLAVE, cfg::EM05_SLAVE};
    for (uint8_t s : spmSlaves) {
      if (!ctPrimaryKnown[s]) {
        Spm33_readCtPrimary(modbus, s);
        delay(cfg::FRAME_GAP_MS);
        break; // зөвхөн нэгийг л оролдоно, цаг хэмнэхийн тулд
      }
    }
  }

  // Цикл бүрд flow-cycle эсвэл totalizer-cycle гэсэн 2 төрлийн нэг нь явна.
  // RS485 bus-н ачааллыг бууруулж, "хоёуланг нь зэрэг уншихгүй" гэсэн
  // шаардлагыг хангахын тулд totalizer-ийг тусад нь 1 минутын циклд уншина.
  // Boot-ийн дараа нэг удаа totalizer-ийг шууд уншиж cache-г бөглөнө.
  bool totalizerCycle = (lastTotalizerReadTime == 0) ||
                        (now - lastTotalizerReadTime >= cfg::TOTALIZER_INTERVAL_MS);

  // Энэ цикл-д Firebase upload руу очих утгууд (flow cycle-ийнх)
  float flow = 0;
  bool flowOk = false;
  Spm33Reading em01, em02, em04, em05;
  float feedFlow = 0;
  bool feedFlowOk = false;
  uint16_t ulsRaw = 0;
  bool ulsLevelOk = false;
  float ulsLevel = 0.0f;

  // Totalizer cycle-ийн төлөв (uploaded утгууд cache-ээс)
  double weightT = 0;
  bool weightOk = false;
  float feedTotal = 0;
  bool feedTotalOk = false;

  if (totalizerCycle) {
    // ── Totalizer cycle: жингийн нийт жин + EM01-05 энерги + feed water totalizer
    lastTotalizerReadTime = now;
    Serial.println("[Cycle] Totalizer read (1 min interval)");

